{
  "personal": {
    "firstname": "Iraklis",
    "familyname": "Symeonidis",
    "title": "Senior Cybersecurity Architect \\ PhD, MSc, ISO/IEC 27001 Certified",
    "email": "iraklis.symeonidis@icloud.com",
    "homepage": "https://isymeonidis.github.io",
    "linkedin": "linkedin.com/in/iraklis-symeonidis",
    "address": "Stockholm, Sweden",
    "mobile": "+46 73-686 22 07",
    "photo": "Files/Isymeonidis_profile_image.jpeg"
  },
  "summary": "Senior Research Scientist at RISE and cybersecurity professional with over a decade of experience securing critical infrastructure and leading teams within complex, multi-stakeholder environments. Expert in coordinating technical and regulatory teams to bridge the gap between engineering execution and strategic governance, ensuring robust alignment with ISO/IEC 27001, GDPR, and emerging EU regulations. Proven ability to translate regulatory frameworks into practical, engineering-driven solutions for cross-domain environments. Recognized for orchestrating secure architecture design, cyber resilience, and governance by aligning cross-functional stakeholders to drive informed, risk-based decision-making. Collaborative team player and communicator, dedicated to fostering a security-first culture and empowering teams to navigate the evolving cybersecurity landscape.",
  "skills": {
    "technical": [
      "Cyber Resilience and Secure Architectures",
      "Security-by-Design and DevSecOps",
      "AI/ML Security and OT/IT Industrial Security",
      "ISO/IEC 27001 Lead Auditor Certified",
      "Regulatory Awareness (GDPR, AI Act, CRA)"
    ],
    "leadership": [
      "Cybersecurity Architectural Guidance",
      "Cross-Functional Coordination",
      "Technical Guidance and Mentoring",
      "Security Culture and Team Enablement",
      "Governance and Strategic Decision-Making"
    ]
  },
  "experience": [
    {
      "start": "2022",
      "end": "Present",
      "role": "Cybersecurity Architect and Senior Researcher",
      "org": "RISE Research Institutes of Sweden",
      "bullets": [
        "Lead secure architecture design for critical infrastructure (Automotive, Telecom, Manufacturing) by embedding security-by-design and DevSecOps principles.",
        "Direct cybersecurity strategy and governance, ensuring alignment with ISO/IEC 27001, GDPR, the AI Act, and emerging EU regulations.",
        "Secure and lead industrial collaborations (Horizon Europe, Vinnova), translating advanced research into applied industrial outcomes.",
        "Mentor engineering teams on threat modeling and risk assessment to foster a resilient security culture."
      ]
    },
    {
      "start": "2020",
      "end": "2022",
      "role": "Scientist, Secure Communications and Cybersecurity",
      "org": "KTH Royal Institute of Technology",
      "bullets": [
        "Designed secure architectures for connected mobility systems with emphasis on resilience, integrity, and safety-critical communication.",
        "Modeled cybersecurity requirements and system behavior for distributed vehicular and edge-based architectures.",
        "Mentored researchers and students in secure networking, applied cryptography, and security engineering."
      ]
    },
    {
      "start": "2018",
      "end": "2020",
      "role": "Scientist, Secure Communications and Architectures",
      "org": "University of Luxembourg",
      "bullets": [
        "Evaluated security of enterprise communication platforms with focus on end-to-end encryption and data protection.",
        "Supported architecture reviews for secure identity, authentication, and data exchange systems."
      ]
    },
    {
      "start": "2012",
      "end": "2018",
      "role": "Scientist, Secure Systems Architectures",
      "org": "KU Leuven (COSIC)",
      "bullets": [
        "Led research on large-scale ecosystem security risks, including analysis of third-party application vulnerabilities (Cambridge Analytica case).",
        "Designed secure data-sharing, key management, and dynamic access management architectures applied in automotive ecosystems."
      ]
    }
  ],
  "projects": [
    {
      "start": "2023",
      "end": "Present",
      "topic": "Automotive, Manufacturing, Supply Chain and Cybersecurity",
      "items": [
        {
          "title": "TWINLOOP (Horizon Europe)",
          "text": "Secure Systems Architecture Lead for a Zero-Trust Digital Twin framework for software-defined electric vehicles. Designed reference security architecture (vehicle-edge-cloud), led threat modeling, and defined controls for cross-OEM interoperability. Security principles and modeling for distributed digital twin operations in automotive and industrial settings."
        },
        {
          "title": "Manufacturing OT/IT Cybersecurity",
          "text": "Contributed to risk assessments, OT/IT threat modeling, and secure automation practices in industrial environments."
        },
        {
          "title": "Datadelning i en digitaliserad köttkedja (FORMAS)",
          "text": "Research on cybersecurity, privacy, and secure data-sharing mechanisms for industrial digitalization and supply-chain transformation."
        }
      ]
    },
    {
      "start": "2023",
      "end": "Present",
      "topic": "Next-Generation Networks and Cybersecurity",
      "items": [
        {
          "title": "CitCom.ai (Digital Europe and Vinnova)",
          "text": "Contribution on cybersecurity, resilience, and connectivity for Data Space connector services. Designed and validated cybersecurity components including identity-based access control, security for data at transfer and at rest for edge/IoT platforms."
        },
        {
          "title": "BEiNG-WISE (COST Action)",
          "text": "Working Group Leader coordinating research on cybersecurity in next-generation wireless systems (5G/6G), including workshops, training, and cross-disciplinary collaboration."
        }
      ]
    },
    {
      "start": "2025",
      "end": "Present",
      "topic": "Sovereignity, Governance and Cybersecurity",
      "items": [
        {
          "title": "NexusForum (Horizon Europe)",
          "text": "Working Group Co-leader of the cybersecurity working group, contributing to the European Research and Innovation Roadmap on secure cognitive computing continuum ecosystems."
        },
        {
          "title": "AI/ML Security Threats",
          "text": "Research on cyber risks emerging from AI-driven and autonomous systems, focusing on robustness, model integrity, and alignment with EU regulatory frameworks (AI Act). Governance and risk modeling contributions across EU-funded projects assessing AI system reliability, secure deployment pipelines, and compliance for safety-critical functions."
        }
      ]
    }
  ],
  "education": [
    {
      "year": "2018",
      "degree": "PhD in Secure and Privacy-Preserving Systems Architectures (automotive focus)",
      "institution": "KU Leuven",
      "location": "Belgium"
    },
    {
      "year": "2013",
      "degree": "MSc in Digital Systems Security",
      "institution": "University of Piraeus",
      "location": "Greece"
    },
    {
      "year": "2004",
      "degree": "Diploma in Information and Communication Systems Engineering",
      "institution": "University of the Aegean",
      "location": "Greece"
    }
  ],
  "certifications": [
    {
      "year": "2013",
      "title": "ISO/IEC 27001 Lead Auditor",
      "issuer": "TÜV NORD"
    },
    {
      "year": "2014",
      "title": "Advanced Cyber Security Course",
      "issuer": "ENCS, The Hague"
    },
    {
      "year": "2014",
      "title": "Secure Application Development",
      "issuer": "SecAppDev, Belgium"
    },
    {
      "year": "2007",
      "title": "Modern pedagogical and teaching methods in education",
      "issuer": "KPH Graz",
      "location": "Austria",
      "url": "http://www.kphgraz.at/"
    }
  ],
  "languages": [
    "English (Fluent)",
    "Greek (Native)",
    "Swedish (A2)"
  ],
  "references": [
    {
      "name": "Larisa Rizvanovic",
      "details": "Hitachi Energy \\ Global Engineering Manager \\ larisa.rizvanovic@hitachienergy.com",
      "hidden": true
    },
    {
      "name": "Andreas Salem",
      "details": "Scania Group \\ Key Account Manager, Defence Sales \\ andrea.salem@scania.com",
      "hidden": true
    }
  ],
  "references_note": "References upon request"
}
